import matplotlib.pyplot as plt
import numpy as np

x_axis_data = range(1,100)  # x
y_axis_data = [765, 1194, 1541, 1862, 2092, 2290, 2526, 2707, 2856, 2994, 3117, 3208, 3278, 3367, 3428, 3488, 3532, 3559, 3581, 3601, 3614, 3656, 3682, 3713, 3702, 3699, 3695, 3699, 3663, 3656, 3628, 3603, 3582, 3553, 3525, 3499, 3466, 3426, 3394, 3361, 3351, 3310, 3266, 3204, 3153, 3123, 3068, 3028, 2968, 2913, 2856, 2823, 2770, 2722, 2680, 2641, 2592, 2537, 2467, 2408, 2347, 2280, 2218, 2160, 2084, 2017, 1960, 1896, 1842, 1779, 1722, 1653, 1600, 1511, 1450, 1398, 1324, 1253, 1194, 1137, 1089, 1033, 969, 912, 845, 777, 725, 670, 610, 551, 499, 443, 399, 332, 282, 208, 164, 108, 53]  # y

plt.plot(x_axis_data, y_axis_data, 'b*--', alpha=0.5, linewidth=1, label='acc')  # 'bo-'表示蓝色实线，数据点实心原点标注
## plot中参数的含义分别是横轴值，纵轴值，线的形状（'s'方块,'o'实心圆点，'*'五角星   ...，颜色，透明度,线的宽度和标签 ，

plt.legend()  # 显示上面的label
plt.xlabel('time')  # x_label
plt.ylabel('number')  # y_label

# plt.ylim(-1,1)#仅设置y轴坐标范围
plt.show()
